Repository: RayanceKing/CCZUHelper
Catalog: CCZUHelper/Localizable.xcstrings
Source language: en
Languages: ja, ko, zh_hans, zh_hant

# intent.error.network
source: Network error. Please try again later
ja: ネットワークエラーです。後でもう一度お試しください
ko: 네트워크 오류입니다. 잠시 후 다시 시도해 주세요
zh_hans: 网络异常，请稍后重试
zh_hant: 網絡异常，請稍后重試

# intent.error.no_data
source: No data available. Please open the app to sync data
ja: 同期
ko: 동기화
zh_hans: 暂无数据，请先打开应用同步
zh_hant: 暂无數據，請先打開應用同步

# intent.error.not_logged_in
source: Please login to the app first
ja: 先にアプリにログインしてください
ko: 먼저 앱에 로그인해 주세요
zh_hans: 请先登录应用
zh_hant: 請先登錄應用

# intent.exam.description
source: View exam schedule for this semester
ja: 試験日程
ko: 시험 일정
zh_hans: 查看本学期的考试安排
zh_hant: 查看本學期的考試安排

# intent.exam.exams_found
source: You have %d exams
ja: 試験が %d 件あります
ko: 시험이 %d개 있습니다
zh_hans: 有 %d 场考试
zh_hant: 有 %d 場考試

# intent.exam.fetch_error
source: Failed to fetch exam schedule: %@
ja: 試験日程
ko: 시험 일정
zh_hans: 获取考试安排失败: %@
zh_hant: 獲取考試安排失敗: %@

# intent.exam.no_data
source: No exam data. Please refresh exam schedule in the app
ja: 試験日程
ko: 시험 일정
zh_hans: 没有考试数据，请在应用中刷新考试安排
zh_hant: 没有考試數據，請在應用中刷新考試安排

# intent.exam.no_exams
source: No exams scheduled
ja: 試験予定はありません
ko: 예정된 시험이 없습니다
zh_hans: 没有考试安排
zh_hant: 没有考試安排

# intent.exam.not_logged_in
source: Please login in the app first
ja: 先にアプリにログインしてください
ko: 먼저 앱에 로그인해 주세요
zh_hans: 请先在应用中登录
zh_hant: 請先在應用中登錄

# intent.exam.title
source: Get Exam Schedule
ja: 試験日程
ko: 시험 일정
zh_hans: 获取考试安排
zh_hant: 獲取考試安排

# intent.field.credit
source: Credit
ja: 単位
ko: 학점
zh_hans: 学分
zh_hant: 學分

# intent.field.location
source: Location
ja: 場所
ko: 장소
zh_hans: 地点
zh_hant: 地點

# intent.field.score
source: Score
ja: 成績
ko: 성적
zh_hans: 成绩
zh_hant: 成績

# intent.field.teacher
source: Teacher
ja: 教師
ko: 교사
zh_hans: 教师
zh_hant: 教師

# intent.field.time
source: Time
ja: 時間
ko: 시간
zh_hans: 时间
zh_hant: 時間

# intent.get_exam_schedule.description
source: Get your exam schedule
ja: 試験日程
ko: 시험 일정
zh_hans: 获取考试安排信息
zh_hant: 獲取考試安排信息

# intent.get_exam_schedule.title
source: Get Exam Schedule
ja: 試験日程
ko: 시험 일정
zh_hans: 获取考试安排
zh_hant: 獲取考試安排

# intent.get_gpa.description
source: Get your GPA and credit information
ja: GPAと単位情報を取得します
ko: GPA 및 학점 정보를 조회합니다
zh_hans: 获取绩点和学分信息
zh_hant: 獲取績點和學分信息

# intent.get_gpa.title
source: Get GPA
ja: GPAを取得
ko: GPA 조회
zh_hans: 获取绩点
zh_hant: 獲取績點

# intent.get_grades.description
source: Get your course grades
ja: コース
ko: 과목
zh_hans: 获取课程成绩
zh_hant: 獲取課程成績

# intent.get_grades.title
source: Get Grades
ja: 成績を取得
ko: 성적 조회
zh_hans: 获取成绩
zh_hant: 獲取成績

# intent.get_next_class.description
source: Get information about your next class
ja: 次の授業情報を取得します
ko: 다음 수업 정보를 조회합니다
zh_hans: 获取下一节课信息
zh_hant: 獲取下一节課信息

# intent.get_next_class.title
source: Get Next Class
ja: 次の授業を取得
ko: 다음 수업 조회
zh_hans: 下一节课
zh_hant: 下一节課

# intent.get_schedule_for_date.description
source: Get your class schedule for a specific date
ja: 指定日の授業予定を取得します
ko: 특정 날짜의 수업 일정을 조회합니다
zh_hans: 获取某一天的课程安排
zh_hant: 獲取某一天的課程安排

# intent.get_schedule_for_date.title
source: Get Schedule for Date
ja: 指定日の時間割を取得
ko: 지정 날짜 시간표 조회
zh_hans: 获取指定日期课程
zh_hant: 獲取指定日期課程

# intent.get_schedule.description
source: Get schedule for today or a specific date
ja: 今日
ko: 오늘
zh_hans: 获取今日或指定日期课表
zh_hant: 獲取今日或指定日期課表

# intent.get_schedule.title
source: Get Schedule
ja: 時間割を取得
ko: 시간표 조회
zh_hans: 获取课表
zh_hant: 獲取課表

# intent.get_today_schedule.description
source: Get your class schedule for today
ja: 今日
ko: 오늘
zh_hans: 获取今天的课程安排
zh_hant: 獲取今天的課程安排

# intent.get_today_schedule.title
source: Get Today's Schedule
ja: 今日
ko: 오늘
zh_hans: 获取今日课程
zh_hant: 獲取今日課程

# intent.get_tomorrow_schedule.description
source: Get your class schedule for tomorrow
ja: 明日の授業予定を取得します
ko: 내일 수업 일정을 조회합니다
zh_hans: 获取明天的课程安排
zh_hant: 獲取明天的課程安排

# intent.get_tomorrow_schedule.title
source: Get Tomorrow's Schedule
ja: 明日の時間割を取得
ko: 내일 시간표 조회
zh_hans: 获取明日课程
zh_hant: 獲取明日課程

# intent.gpa.description
source: View your GPA information
ja: 単位とGPA情報を表示
ko: 학점 및 GPA 정보를 조회합니다
zh_hans: 查看学分绩点信息
zh_hant: 查看學分績點信息

# intent.gpa.fetch_error
source: Failed to fetch GPA: %@
ja: GPAの取得に失敗しました: %@
ko: GPA 조회 실패: %@
zh_hans: 获取GPA失败: %@
zh_hant: 獲取GPA失敗: %@

# intent.gpa.no_data
source: No GPA data. Please refresh GPA in the app
ja: GPAデータがありません。アプリで更新してください
ko: GPA 데이터가 없습니다. 앱에서 새로고침해 주세요
zh_hans: 没有GPA数据，请在应用中刷新学分绩点
zh_hant: 没有GPA數據，請在應用中刷新學分績點

# intent.gpa.not_logged_in
source: Please login in the app first
ja: 先にアプリにログインしてください
ko: 먼저 앱에 로그인해 주세요
zh_hans: 请先在应用中登录
zh_hant: 請先在應用中登錄

# intent.gpa.title
source: Get GPA
ja: GPAを取得
ko: GPA 조회
zh_hans: 获取GPA
zh_hant: 獲取GPA

# intent.gpa.your_gpa
source: Your GPA is %.2f
ja: あなたのGPAは %.2f です
ko: 당신의 GPA는 %.2f입니다
zh_hans: 你的GPA是 %.2f
zh_hant: 你的GPA是 %.2f

# intent.grades.description
source: View grades for this semester
ja: 今学期の成績を表示
ko: 이번 학기 성적을 조회합니다
zh_hans: 查看本学期的成绩
zh_hant: 查看本學期的成績

# intent.grades.fetch_error
source: Failed to fetch grades: %@
ja: 成績の取得に失敗しました: %@
ko: 성적 조회 실패: %@
zh_hans: 获取成绩失败: %@
zh_hant: 獲取成績失敗: %@

# intent.grades.grades_found
source: You have grades for %d courses
ja: コース
ko: 과목
zh_hans: 有 %d 门课程成绩
zh_hant: 有 %d 門課程成績

# intent.grades.no_data
source: No grade data. Please refresh grades in the app
ja: 成績データがありません。アプリで更新してください
ko: 성적 데이터가 없습니다. 앱에서 새로고침해 주세요
zh_hans: 没有成绩数据，请在应用中刷新成绩
zh_hant: 没有成績數據，請在應用中刷新成績

# intent.grades.no_grades
source: No grades available
ja: 利用可能な成績がありません
ko: 표시할 성적이 없습니다
zh_hans: 没有成绩记录
zh_hant: 没有成績記錄

# intent.grades.not_logged_in
source: Please login in the app first
ja: 先にアプリにログインしてください
ko: 먼저 앱에 로그인해 주세요
zh_hans: 请先在应用中登录
zh_hant: 請先在應用中登錄

# intent.grades.param_term
source: Term
ja: 学期
ko: 학기
zh_hans: 学期
zh_hant: 學期

# intent.grades.speech.full_list
source: You have %d grades. The first 3 are: %@. Here are the full grade details.
ja: 成績は%d件あります。最初の3件は%@です。以下は成績の詳細です。
ko: 성적은 총 %d개입니다. 처음 3개는 %@입니다. 아래는 전체 성적 상세입니다.
zh_hans: 共 %d 门成绩。前 3 门是：%@。以下为全部成绩详情。
zh_hant: 共 %d 門成績。前 3 門是：%@。以下為全部成績詳情。

# intent.grades.speech.preview_and_continue
source: You have %d grades. The first 3 are: %@. Do you want me to continue with the remaining %d?
ja: 成績は%d件あります。最初の3件は%@です。残り%d件も読み上げますか？
ko: 성적은 총 %d개입니다. 처음 3개는 %@입니다. 나머지 %d개도 계속 읽어드릴까요?
zh_hans: 共 %d 门成绩。前 3 门是：%@。还要继续播报剩余 %d 门吗？
zh_hant: 共 %d 門成績。前 3 門是：%@。還要繼續播報剩餘 %d 門嗎？

# intent.grades.speech.stopped_after_preview
source: Okay, I stopped here. I have reported the first %d grades.
ja: 了解しました。最初の%d件まで読み上げました。
ko: 네, 여기까지 읽어드렸어요. 앞의 %d개 성적을 안내했습니다.
zh_hans: 好的，先播报到这里，已播报前 %d 门成绩。
zh_hant: 好的，先播報到這裡，已播報前 %d 門成績。

# intent.grades.title
source: Get Grades
ja: 成績を取得
ko: 성적 조회
zh_hans: 获取成绩
zh_hant: 獲取成績

# intent.has_class_today.description
source: Check if you have classes today
ja: 检查今天是否有コース
ko: 오늘
zh_hans: 检查今天是否有课程
zh_hant: 檢查今天是否有課程

# intent.has_class_today.title
source: Has Class Today
ja: 今日
ko: 오늘
zh_hans: 今天有课吗
zh_hant: 今天有課吗

# intent.has_class.description
source: Check if you have classes today
ja: 检查今天是否有コース
ko: 오늘
zh_hans: 检查今天是否有课程
zh_hant: 檢查今天是否有課程

# intent.has_class.no
source: No classes today
ja: 今日
ko: 오늘
zh_hans: 今天没有课
zh_hant: 今天没有課

# intent.has_class.title
source: Do I Have Class Today
ja: 今日
ko: 오늘
zh_hans: 今天有课吗
zh_hant: 今天有課吗

# intent.has_class.yes
source: Yes, you have classes today
ja: 今日
ko: 오늘
zh_hans: 今天有课
zh_hant: 今天有課

# intent.next_class.description
source: View your next class information
ja: 次の授業情報を表示
ko: 다음 수업 정보 보기
zh_hans: 查看下一节课的信息
zh_hant: 查看下一节課的信息

# intent.next_class.found
source: Next class: %@ at %@
ja: 次の授業: %@（%@）
ko: 다음 수업: %@ (%@)
zh_hans: 下一节课: %@ 在 %@
zh_hant: 下一节課: %@ 在 %@

# intent.next_class.no_more
source: No more classes today
ja: 今日
ko: 오늘
zh_hans: 今天没有更多课程了
zh_hant: 今天没有更多課程了

# intent.next_class.none_today
source: No more classes today.
ja: 今日
ko: 오늘
zh_hans: 今天没有后续课程。
zh_hant: 今天没有后續課程。

# intent.next_class.prefix
source: Your next class
ja: 次の授業
ko: 다음 수업
zh_hans: 下一节课
zh_hant: 下一节課

# intent.next_class.title
source: Next Class
ja: 次の授業
ko: 다음 수업
zh_hans: 下一节课
zh_hant: 下一节課

# intent.open_grades.description
source: Open the grades page
ja: 成績ページを開く
ko: 성적 조회 페이지를 엽니다
zh_hans: 打开成绩查询页面
zh_hant: 打開成績查詢頁面

# intent.open_grades.title
source: Open Grades
ja: 成績を開く
ko: 성적 조회 열기
zh_hans: 打开成绩查询
zh_hant: 打開成績查詢

# intent.open_schedule.description
source: Open the schedule page
ja: 打开コース表页面
ko: 시간표 페이지 열기
zh_hans: 打开课程表页面
zh_hant: 打開課程表頁面

# intent.open_schedule.title
source: Open Schedule
ja: 時間割を開く
ko: 시간표 열기
zh_hans: 打开课程表
zh_hant: 打開課程表

# intent.param.date.description
source: Date to query (optional, default is today)
ja: 今日
ko: 오늘
zh_hans: 要查询的日期（可选，默认今天）
zh_hant: 要查詢的日期（可選，默認今天）

# intent.param.date.title
source: Date
ja: 日付
ko: 날짜
zh_hans: 日期
zh_hant: 日期

# intent.param.term.description
source: Specific term (optional)
ja: 学期を指定（任意）
ko: 특정 학기(선택)
zh_hans: 指定学期（可选）
zh_hant: 指定學期（可選）

# intent.param.term.title
source: Term
ja: 学期
ko: 학기
zh_hans: 学期
zh_hant: 學期

# intent.result.classes_for_date
source: Classes for %@
ja: %@ の授業
ko: %@의 수업
zh_hans: %@ 的课程安排
zh_hant: %@ 的課程安排

# intent.result.exam_schedule_header
source: Exam Schedule
ja: 試験日程
ko: 시험 일정
zh_hans: 考试安排
zh_hant: 考試安排

# intent.result.gpa_course_count
source: Course Count: %d
ja: コース
ko: 과목
zh_hans: 课程总数：%d
zh_hant: 課程總數：%d

# intent.result.gpa_overall
source: Overall GPA: %@
ja: 総合GPA: %@
ko: 전체 GPA: %@
zh_hans: 总绩点：%@
zh_hant: 總績點：%@

# intent.result.gpa_passed_count
source: Passed Courses: %d/%d
ja: コース
ko: 과목
zh_hans: 通过课程：%d/%d
zh_hant: 通過課程：%d/%d

# intent.result.gpa_summary_header
source: GPA Summary
ja: GPA概要
ko: GPA 요약
zh_hans: 绩点汇总
zh_hant: 績點匯總

# intent.result.gpa_total_credits
source: Total Credits: %@
ja: 総単位数: %@
ko: 총 학점: %@
zh_hans: 总学分：%@
zh_hant: 總學分：%@

# intent.result.grades_header
source: Grades
ja: 成績
ko: 성적
zh_hans: 成绩
zh_hant: 成績

# intent.result.no_classes_for_date
source: No classes scheduled for %@.
ja: %@ の授業予定はありません。
ko: %@에 예정된 수업이 없습니다.
zh_hans: %@ 无课程安排。
zh_hant: %@ 无課程安排。

# intent.result.no_exams
source: No exams scheduled.
ja: 試験予定はありません。
ko: 예정된 시험이 없습니다.
zh_hans: 暂无考试安排。
zh_hant: 暂无考試安排。

# intent.result.no_gpa_data
source: No grade data available to calculate GPA.
ja: GPA計算に必要な成績データがありません。
ko: GPA 계산에 필요한 성적 데이터가 없습니다.
zh_hans: 暂无可用于计算绩点的数据。
zh_hant: 暂无可用於計算績點的數據。

# intent.result.no_grades
source: No grades available.
ja: 利用可能な成績がありません。
ko: 표시할 성적이 없습니다.
zh_hans: 暂无成绩数据。
zh_hant: 暂无成績數據。

# intent.schedule.courses_today
source: You have %d classes today
ja: 今天有 %d 节コース
ko: 오늘
zh_hans: 今天有 %d 节课程
zh_hant: 今天有 %d 节課程

# intent.schedule.description
source: View course schedule for a specific date
ja: コース
ko: 과목
zh_hans: 查看指定日期的课程安排
zh_hant: 查看指定日期的課程安排

# intent.schedule.fetch_error
source: Failed to fetch schedule: %@
ja: 時間割の取得に失敗しました: %@
ko: 시간표 조회 실패: %@
zh_hans: 获取课程表失败: %@
zh_hant: 獲取課程表失敗: %@

# intent.schedule.no_courses
source: No classes today
ja: 今日
ko: 오늘
zh_hans: 今天没有课程
zh_hant: 今天没有課程

# intent.schedule.no_data
source: No schedule data. Please import schedule in the app
ja: スケジュールがありません
ko: 일정이 없습니다
zh_hans: 没有课程数据，请在应用中导入课表
zh_hant: 没有課程數據，請在應用中導入課表

# intent.schedule.not_logged_in
source: Please login in the app first
ja: 先にアプリにログインしてください
ko: 먼저 앱에 로그인해 주세요
zh_hans: 请先在应用中登录
zh_hant: 請先在應用中登錄

# intent.schedule.param_date
source: Date
ja: 日付
ko: 날짜
zh_hans: 日期
zh_hant: 日期

# intent.schedule.title
source: Get Schedule
ja: 時間割を取得
ko: 시간표 조회
zh_hans: 获取课程表
zh_hant: 獲取課程表

# intent.short.get_exams
source: Get Exams
ja: 試験予定を取得
ko: 시험 일정 조회
zh_hans: 获取考试
zh_hant: 獲取考試

# intent.short.get_gpa
source: Get GPA
ja: GPAを取得
ko: GPA 조회
zh_hans: 获取绩点
zh_hant: 獲取績點

# intent.short.get_grades
source: Get Grades
ja: 成績を取得
ko: 성적 조회
zh_hans: 获取成绩
zh_hant: 獲取成績

# intent.short.get_schedule
source: Get Schedule
ja: 時間割を取得
ko: 시간표 조회
zh_hans: 获取课表
zh_hant: 獲取課表

# intent.short.has_class_today
source: Has Class Today
ja: 今日
ko: 오늘
zh_hans: 今日有课吗
zh_hant: 今日有課吗

# intent.short.next_class
source: Next Class
ja: 次の授業
ko: 다음 수업
zh_hans: 下一节课
zh_hant: 下一节課

# intent.short.open_grades
source: Open Grades
ja: 成績を開く
ko: 성적 열기
zh_hans: 打开成绩
zh_hant: 打開成績

# intent.short.open_schedule
source: Open Schedule
ja: 時間割を開く
ko: 시간표 열기
zh_hans: 打开课表
zh_hant: 打開課表

# intent.short.schedule_for_date
source: Schedule for Date
ja: 日付指定の時間割
ko: 날짜별 시간표
zh_hans: 指定日期课程
zh_hant: 指定日期課程

# intent.short.today_schedule
source: Today's Schedule
ja: 今日コース
ko: 오늘
zh_hans: 今日课程
zh_hant: 今日課程

# intent.short.tomorrow_schedule
source: Tomorrow's Schedule
ja: 明日の時間割
ko: 내일 시간표
zh_hans: 明日课程
zh_hant: 明日課程

# intent.speech.schedule_courses
source: Classes on %@: %@.
ja: %@ の授業: %@。
ko: %@의 수업: %@.
zh_hans: %@ 的课程有：%@。
zh_hant: %@ 的課程有：%@。

# intent.summary.get_grades
source: Get grades for
ja: 成績を取得
ko: 성적 조회
zh_hans: 获取成绩
zh_hant: 獲取成績

# intent.summary.get_grades ${term}
source: Get grades for ${term}
ja: ${term}の成績を取得
ko: ${term} 성적 조회
zh_hans: 获取 ${term} 的成绩
zh_hant: 獲取 ${term} 的成績

# intent.summary.get_schedule
source: Get schedule for
ja: 時間割を取得
ko: 시간표 조회
zh_hans: 获取课表
zh_hant: 獲取課表

# intent.summary.get_schedule ${date}
source: Get schedule for ${date}
ja: ${date}の時間割を確認
ko: ${date} 시간표 확인
zh_hans: 查看 ${date} 的课表
zh_hant: 查看 ${date} 的課表

# intent.term.all
source: All Terms
ja: すべて学期
ko: 전체학기
zh_hans: 全部学期
zh_hant: 全部學期

# intent.today_schedule.description
source: View today's course schedule
ja: 查看今天的コース安排
ko: 오늘
zh_hans: 查看今天的课程安排
zh_hant: 查看今天的課程安排

# intent.today_schedule.has_classes
source: You have %d classes today
ja: 今天有 %d 节コース
ko: 오늘
zh_hans: 今天有 %d 节课程
zh_hant: 今天有 %d 节課程

# intent.today_schedule.no_classes
source: No classes today 🎉
ja: 今日
ko: 오늘
zh_hans: 今天没有课程 🎉
zh_hant: 今天没有課程 🎉

# intent.today_schedule.title
source: Today's Classes
ja: 今日コース
ko: 오늘
zh_hans: 今日课程
zh_hant: 今日課程

# intent.tomorrow_schedule.description
source: View tomorrow's course schedule
ja: コース
ko: 과목
zh_hans: 查看明天的课程安排
zh_hant: 查看明天的課程安排

# intent.tomorrow_schedule.has_classes
source: You have %d classes tomorrow
ja: 明日の授業は %d 件あります
ko: 내일 수업이 %d개 있습니다
zh_hans: 明天有 %d 节课程
zh_hant: 明天有 %d 节課程

# intent.tomorrow_schedule.no_classes
source: No classes tomorrow 🎉
ja: 明日の授業はありません 🎉
ko: 내일 수업이 없습니다 🎉
zh_hans: 明天没有课程 🎉
zh_hant: 明天没有課程 🎉

# intent.tomorrow_schedule.title
source: Tomorrow's Classes
ja: 明日の授業
ko: 내일 수업
zh_hans: 明日课程
zh_hant: 明日課程

# login.and
source: and
ja: と
ko: 및
zh_hans: 和
zh_hant: 和

# login.button
source: Login
ja: ログイン
ko: 로그인
zh_hans: 登录
zh_hant: 登入

# login.email
source: Email
ja: メールアドレス
ko: 이메일
zh_hans: 邮箱
zh_hant: 郵箱

# login.error.timeout
source: Request timeout, please try again later
ja: 時間
ko: 시간
zh_hans: 请求超时，请稍后重试
zh_hant: 請求超時，請稍后重試

source: Login Failed
ja: ログイン失敗
ko: 로그인 실패
zh_hans: 登录失败
zh_hant: 登入失敗

# login.forgot_password
source: Forgot Password?
ja: パスワードをお忘れですか？
ko: 비밀번호를 잊으셨나요?
zh_hans: 忘记密码？
zh_hant: 忘記密碼？

# login.hint
source: Use your Changzhou University unified authentication account
ja: 常州大学の統合認証アカウントを使用してください
ko: 창저우 대학 통합 인증 계정을 사용하세요
zh_hans: 使用您的常州大学统一身份认证账号登录
zh_hant: 使用您的常州大學統一身份認證帳號登入

# login.password
source: Password
ja: パスワード
ko: 비밀번호
zh_hans: 密码
zh_hant: 密碼

# login.password.placeholder
source: Password
ja: パスワード
ko: 비밀번호
zh_hans: 密码
zh_hant: 密碼

# login.privacy_policy
source: Privacy Policy
ja: プライバシーポリシー
ko: 개인정보 처리방침
zh_hans: 《隐私权限》
zh_hant: 《隱私權限》

# login.terms_of_service
source: Terms of Service
ja: 《ユーザー协议》
ko: 이용약관
zh_hans: 《用户协议》
zh_hant: 《用戶協議》

# login.terms_prefix
source: I have read and agree to the
ja: 以下を読み、同意しました
ko: 다음을 읽고 동의합니다
zh_hans: 我已经阅读并同意
zh_hant: 我已經閱讀並同意

# login.title
source: Login
ja: ログイン
ko: 로그인
zh_hans: 登录
zh_hant: 登入

# login.username.placeholder
source: Student ID
ja: 学生ID
ko: 학번
zh_hans: 学号
zh_hant: 學號

# logout.button
source: Sign Out
ja: ログアウト
ko: 로그아웃
zh_hans: 退出登录
zh_hant: 退出登錄

# logout.confirm_message
source: Are you sure you want to sign out?
ja: ログアウトしてもよろしいですか？
ko: 로그아웃하시겠습니까?
zh_hans: 确定要退出登录吗？
zh_hant: 確定要登出嗎？

# logout.confirm_title
source: Sign Out
ja: ログアウト
ko: 로그아웃
zh_hans: 退出登录
zh_hant: 登出

# manage_schedules.import_time
source: Import time: %@
ja: 导入時間: %@
ko: 시간
zh_hans: 导入时间: %@
zh_hant: 導入時間: %@

# manage_schedules.no_schedules
source: No Schedules
ja: スケジュールがありません
ko: 일정이 없습니다
zh_hans: 暂无课表
zh_hant: 暂无課表

# manage_schedules.no_schedules_hint
source: Click the top right button to import schedule
ja: インポート
ko: 가져오기
zh_hans: 点击右上角按钮导入课表
zh_hant: 點擊右上角按钮導入課表

# manage_schedules.title
source: Manage Schedules
ja: 管理
ko: 관리
zh_hans: 管理课表
zh_hant: 管理課表

# notice.loading_failed
source: Loading Failed
ja: 読み込み失敗
ko: 로딩 실패
zh_hans: 加载失败
zh_hant: 加載失敗

# notice.no_notices_desc
source: There are no new teaching notices
ja: 教務通知
ko: 교무 공지
zh_hans: 当前没有新的教务通知
zh_hant: 當前没有新的教務通知

# notice.title
source: Teaching Notice
ja: 教務通知
ko: 교무 공지
zh_hans: 教务通知
zh_hant: 教務通知

# platform.export_not_supported
source: Sharing/exporting is not supported on this platform
ja: このプラットフォームでは共有/エクスポートはサポートされていません
ko: 이 플랫폼에서는 공유/내보내기가 지원되지 않습니다
zh_hans: 当前平台不支持分享导出
zh_hant: 當前平台不支援分享匯出

# post.author_anonymous
source: Author: Anonymous
ja: 投稿者: 匿名
ko: 작성자: 익명
zh_hans: 发布者: 匿名
zh_hant: 發布者: 匿名

# post.author_format
source: Author: %@
ja: 投稿者: %@
ko: 작성자: %@
zh_hans: 发布者: %@
zh_hant: 發布者: %@

# post.create.anonymous
source: Post anonymously
ja: 匿名で投稿
ko: 익명게시
zh_hans: 匿名发布
zh_hant: 匿名發佈

# post.create.anonymous_user
source: Anonymous
ja: 匿名ユーザー
ko: 익명 사용자
zh_hans: 匿名用户
zh_hant: 匿名用户

# post.create.category
source: Category
ja: カテゴリー
ko: 카테고리
zh_hans: 分类
zh_hant: 分類

# post.create.category_select
source: Select Category
ja: カテゴリを選択
ko: 카테고리 선택
zh_hans: 选择分类
zh_hant: 選擇分類

# post.create.content
source: Content
ja: 内容
ko: 내용
zh_hans: 内容
zh_hant: 內容

# post.create.failed
source: Publish failed: %@
ja: 投稿に失敗しました: %@
ko: 게시 실패: %@
zh_hans: 发布失败: %@
zh_hant: 發佈失敗: %@

# post.create.hint
source: Hint
ja: ヒント
ko: 힌트
zh_hans: 提示
zh_hant: 提示

# post.create.images
source: Images (Optional, max %d)
ja: 画像（任意、最大 %d 枚）
ko: 이미지(선택, 최대 %d장)
zh_hans: 图片（可选，最多%d张）
zh_hant: 圖片（可選，最多%d張）

# post.create.publish
source: Publish
ja: 公開
ko: 게시
zh_hans: 发布
zh_hant: 發佈

# post.create.success
source: Published successfully!
ja: 投稿に成功しました
ko: 게시성공！
zh_hans: 发布成功！
zh_hant: 發佈成功！

# post.create.test_notice
source: Posts will be visible to everyone after publishing
ja: 投稿後、すべてのユーザーに公開されます
ko: 게시 후 모든 사용자가 볼 수 있습니다
zh_hans: 帖子发布后所有人可见
zh_hant: 帖子發佈后所有人可見

# post.create.title
source: Create Post
ja: 投稿を作成
ko: 게시게시물
zh_hans: 发布帖子
zh_hant: 發佈帖子

# post.create.title_field
source: Title
ja: タイトル
ko: 제목
zh_hans: 标题
zh_hant: 標題

# post.create.title_placeholder
source: Enter title
ja: タイトルを入力
ko: 제목 입력
zh_hans: 请输入标题
zh_hant: 請輸入標題

# post.disable_anonymous
source: Disable Anonymous
ja: 匿名を解除
ko: 익명 취소
zh_hans: 取消匿名
zh_hant: 取消匿名

# post.enable_anonymous
source: Post Anonymously
ja: 匿名で投稿
ko: 익명으로 게시
zh_hans: 设为匿名
zh_hant: 設為匿名

# post.invalid_id
source: Invalid post ID
ja: 無効な投稿ID
ko: 잘못된 게시물 ID
zh_hans: 帖子ID无效
zh_hant: 帖子ID無效

# post.my_comments
source: My Comments
ja: コメントした記事
ko: 댓글 단 게시물
zh_hans: 我评论的
zh_hant: 我評論的

# post.my_content
source: My Content
ja: マイコンテンツ
ko: 내 콘텐츠
zh_hans: 我的内容
zh_hant: 我的內容

# post.my_likes
source: My Likes
ja: いいねした記事
ko: 좋아요한 게시물
zh_hans: 我点赞的
zh_hant: 我點讚的

# post.my_posts
source: My Posts
ja: 投稿した記事
ko: 내가 작성한 게시물
zh_hans: 我发的帖
zh_hant: 我發的帖

# post.no_content
source: No content
ja: 内容なし
ko: 내용 없음
zh_hans: 无内容
zh_hant: 無內容

# post.no_reported
source: No reported posts
ja: 通報された投稿はありません
ko: 신고된 게시물이 없습니다
zh_hans: 暂无被举报的帖子
zh_hant: 暫無被舉報的帖子

# post.unknown_time
source: Unknown time
ja: 不明な時刻
ko: 알 수 없는 시간
zh_hans: 未知时间
zh_hant: 未知時間

# post.untitled
source: Untitled
ja: タイトルなし
ko: 제목 없음
zh_hans: 无标题
zh_hant: 無標題

# privilege.title
source: Premium Features
ja: プレミアム機能
ko: 프리미엄 기능
zh_hans: 特权功能
zh_hant: 特權功能

# privileges.title
source: Premium Features
ja: プレミアム機能
ko: 프리미엄 기능
zh_hans: 特权功能
zh_hant: 特權功能

# profile_setup.college
source: College
ja: 学院
ko: 단과대
zh_hans: 学院
zh_hant: 學院

# profile_setup.student_id
source: Student ID
ja: 学生ID
ko: 학번
zh_hans: 学号
zh_hant: 學號

# profile_setup.submit
source: Submit
ja: 提出
ko: 제출
zh_hans: 提交
zh_hant: 提交

# profile.customize
source: Customize Profile
ja: プロフィールをカスタマイズ
ko: 프로필 커스터마이즈
zh_hans: 自定义个人资料
zh_hant: 自訂個人資料

# profile.customize_hint
source: Customize your profile
ja: プロフィールをカスタマイズ
ko: 프로필 사용자 지정
zh_hans: 自定义你的个人资料
zh_hant: 自定義你的個人資料

# profile.customize_prompt
source: Customize your profile
ja: プロフィールをカスタマイズする
ko: 프로필을 커스터마이즈하세요
zh_hans: 自定义你的个人资料
zh_hant: 自訂你的個人資料

# profile.enter_nickname
source: Enter nickname
ja: ニックネームを入力
ko: 닉네임 입력
zh_hans: 输入昵称
zh_hant: 輸入暱稱

# profile.my_comments
source: My Comments
ja: コメントした投稿
ko: 내가 댓글 단 게시물
zh_hans: 我评论的
zh_hant: 我評論的

# profile.my_likes
source: My Likes
ja: いいねした投稿
ko: 내가 좋아요한 게시물
zh_hans: 我点赞的
zh_hant: 我點讚的

# profile.my_posts
source: My Posts
ja: 自分の投稿
ko: 내가 쓴 게시물
zh_hans: 我发的帖
zh_hant: 我發的帖

# profile.nickname
source: Nickname
ja: ニックネーム
ko: 닉네임
zh_hans: 昵称
zh_hant: 暱稱

# profile.nickname_placeholder
source: Enter nickname
ja: ニックネームを入力
ko: 닉네임 입력
zh_hans: 输入昵称
zh_hant: 輸入昵稱

# profile.visibility_notice
source: Your avatar and nickname are visible to everyone.
ja: アバターとニックネームは全員に表示されます。
ko: 아바타와 닉네임은 모든 사람에게 표시됩니다.
zh_hans: 你的头像和昵称对所有人可见。
zh_hant: 你的頭像和暱稱對所有人可見。

# registration.profile.complete
source: Complete
ja: 完了
ko: 완료
zh_hans: 完成
zh_hant: 完成

# report.author_anonymous
source: Author: Anonymous
ja: 投稿者: 匿名
ko: 작성자: 익명
zh_hans: 发布者: 匿名
zh_hant: 發布者: 匿名

# report.author_format
source: Author: %@
ja: 投稿者: %@
ko: 작성자: %@
zh_hans: 发布者: %@
zh_hant: 發布者: %@

# report.confirm_delete
source: Confirm Delete
ja: 削除の確認
ko: 삭제 확인
zh_hans: 确认删除
zh_hant: 確認刪除

# report.confirm_ignore
source: Confirm Ignore
ja: 無視を確認
ko: 무시 확인
zh_hans: 确认忽略
zh_hant: 確認忽略

# report.count_format
source: Reports: %d
ja: 通報: %d
ko: 신고: %d
zh_hans: 举报: %d
zh_hant: 舉報: %d

# report.error.not_logged_in
source: Please login first
ja: まずログインしてください
ko: 먼저 로그인해주세요
zh_hans: 请先登录
zh_hant: 請先登錄

# report.error.select_reason
source: Please select a reason for reporting
ja: 選択してください举报原因
ko: 선택하세요举报原因
zh_hans: 请选择举报原因
zh_hant: 請選擇舉報原因

# report.ignore_failed_format
source: Ignore failed: %@
ja: 無視に失敗しました: %@
ko: 무시 실패: %@
zh_hans: 忽略失败: %@
zh_hant: 忽略失敗: %@

# report.ignore_message
source: Are you sure you want to ignore this report? The report will be removed but the post will remain.
ja: この通報を無視してもよろしいですか？通報は削除されますが、投稿は残ります。
ko: 이 신고를 무시하시겠습니까? 신고는 제거되지만 게시물은 유지됩니다.
zh_hans: 确定要忽略这条举报吗？这条举报将被移除，但帖子将保留。
zh_hant: 確定要忽略這條舉報嗎？這條舉報將被移除，但帖子將保留。

# report.more_format
source: ...and %d more reports
ja: ...他%d件の通報
ko: ...외 %d개 신고
zh_hans: ...还有%d条举报
zh_hant: ...還有%d條舉報

# report.more_reports_format
source: ...%d more reports
ja: ...他%d件の通報
ko: ...%d개의 신고 더 보기
zh_hans: ...还有%d条举报
zh_hant: ...還有%d條舉報

# report.no_reports
source: No Reported Posts
ja: 通報された投稿はありません
ko: 신고된 게시물 없음
zh_hans: 暂无被举报的帖子
zh_hant: 暫無被舉報的帖子

# report.pending
source: Pending Reports
ja: 保留中の通報
ko: 대기 중인 신고
zh_hans: 待处理举报
zh_hant: 待處理舉報

# report.reason.other
source: Other
ja: その他
ko: 기타
zh_hans: 其他
zh_hant: 其他

source: Report Reasons:
ja: 通報理由:
ko: 신고 사유:
zh_hans: 举报原因:
zh_hant: 舉報原因:

# schedule_component.class_time
source: Class Time
ja: 時間
ko: 시간
zh_hans: 上课时间
zh_hant: 上課時間

# schedule_component.course
source: Course
ja: コース
ko: 과목
zh_hans: 课程
zh_hant: 課程

# schedule_component.course_color
source: Course Color
ja: コース
ko: 과목
zh_hans: 课程颜色
zh_hant: 課程顏色

# schedule_component.course_color_hint
source: Tap a swatch to change the course block color
ja: コース
ko: 과목
zh_hans: 点击圆点可更换课程块颜色
zh_hant: 點擊圓點可更換課程块顏色

# schedule_component.course_detail
source: Course Details
ja: コース
ko: 과목
zh_hans: 课程详情
zh_hant: 課程详情

# schedule_component.day_of_week
source: Day of the week
ja: 週
ko: 주
zh_hans: 星期几
zh_hant: 星期幾

# schedule_component.delete_confirm_message
source: Are you sure you want to delete this course? This action cannot be undone.
ja: コース
ko: 과목
zh_hans: 确定要删除这门课程吗？此操作无法撤销。
zh_hant: 確定要刪除这門課程吗？此操作无法撤銷。

# schedule_component.delete_confirm_title
source: Delete Course
ja: コース
ko: 과목
zh_hans: 删除课程
zh_hant: 刪除課程
